/*Тема: довжина вектора

Визначити довжину вектора за його координатами. 

Вхідні дані: чотири цілі числа х1, у1, х2, у2 - кордина ти початку та кінця вектора відповідно

Вихідні дані: одне число - довжина вектора з точністю до шести знаків після коми

Обчисліть різницю координат по кожній осі, шляхом віднімання відповідних значень. 
Отримайте dx = x2 - x1 та dy = y2 - y1.

Обчисліть квадрати різниць координат, шляхом помноження кожної різниці на саму себе. 
Отримайте dx^2 та dy^2.

Обчисліть суму квадратів різниць координат, шляхом додавання dx^2 та dy^2. 
Отримайте суму dx^2 + dy^2.

Обчисліть квадратний корінь від суми квадратів, шляхом використання математичної функції квадратного кореня. 
Отримайте довжину вектора, sqrt(dx^2 + dy^2).*/

#include <stdio.h>
#include <math.h> 

int main () {
    int x1 = 0, y1 = 0, x2 = 0, y2 = 0;

    printf("Введіть координати вектора послідовно через пробіл(x1 y1 x2 y2): ");
    scanf("%d %d %d %d", &x1, &y1, &x2, &y2);

    int dx = x2 - x1;
    int dy = y2 - y1;

    float length = sqrt((pow(dx, 2) + pow(dy, 2)));
    printf("\nДовжина введеного вектора становить %.6f", length);
}

